mkj/imxrt-pacs/svd/MIMXRT1041.svd
        <register>
          <name>REG1</name>
          <description>DCDC Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x111BA29C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_FBK_SEL</name>
              <description>Select the feedback point of the internal regulator</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>reg_fbk_sel0</name>
                  <description>The regulator outputs 1.0V with 1.2V reference voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_fbk_sel1</name>
                  <description>The regulator outputs 1.1V with 1.2V reference voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_fbk_sel2</name>
                  <description>The regulator outputs 1.0V with 1.3V reference voltage</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_fbk_sel3</name>
                  <description>The regulator outputs 1.1V with 1.3V reference voltage</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG_RLOAD_SW</name>
              <description>This controls the load resistor of the internal regulator of DCDC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>loadR_disconnect</name>
                  <description>Load resistor disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>loadR_connect</name>
                  <description>Load resistor connected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_CMP_ISRC_SEL</name>
              <description>Low Power Comparator Current Bias</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sel0</name>
                  <description>50 nA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel1</name>
                  <description>100 nA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel2</name>
                  <description>200 nA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel3</name>
                  <description>400 nA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCTRL_HST_THRESH</name>
              <description>Increase Threshold Detection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_hyst_thresh</name>
                  <description>Lower hysteresis threshold (about 2.5mV in typical, but this value can vary with PVT corners</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_hyst_thresh</name>
                  <description>Higher hysteresis threshold (about 5mV in typical)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCTRL_EN_HYST</name>
              <description>Enable Hysteresis</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable hysteresis in switching converter common mode analog comparators</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable hysteresis in switching converter common mode analog comparators</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBG_TRIM</name>
              <description>Trim Bandgap Voltage</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG2</name>
          <description>DCDC Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOOPCTRL_DC_FF</name>
              <description>Two's complement feed forward step in duty cycle in the switching DC-DC converter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_EN_RCSCALE</name>
              <description>Enable RC Scale</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPCTRL_RCSCALE_THRSH</name>
              <description>Increase the threshold detection for RC scale circuit.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_increase_thrsh</name>
                  <description>Do not increase the threshold detection for RC scale circuit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>increase_thrsh</name>
                  <description>Increase the threshold detection for RC scale circuit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCTRL_HYST_SIGN</name>
              <description>Invert the sign of the hysteresis in DC-DC analog comparators.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noinvert</name>
                  <description>Do not invert sign of the hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invert</name>
                  <description>Invert sign of the hysteresis</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE_PULSE_SKIP</name>
              <description>Disable Pulse Skip</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>DCDC will be idle to save current dissipation when the duty cycle get to the low limit which is set by NEGLIMIT_IN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>not_idle</name>
                  <description>DCDC will keep working with the low limited duty cycle NEGLIMIT_IN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCM_SET_CTRL</name>
              <description>DCM Set Control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG3</name>
          <description>DCDC Register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRG</name>
              <description>Target value of VDD_SOC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET_LP</name>
              <description>Low Power Target Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sel0</name>
                  <description>0.9 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel1</name>
                  <description>0.925 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel2</name>
                  <description>0.95 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel3</name>
                  <description>0.975 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel4</name>
                  <description>1.0 V</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINPWR_DC_HALFCLK</name>
              <description>Set DCDC clock to half frequency for continuous mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fullfreq</name>
                  <description>DCDC clock remains at full frequency for continuous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>halffreq</name>
                  <description>DCDC clock set to half frequency for continuous mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE_STEP</name>
              <description>Disable Step</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable stepping for the output of VDD_SOC of DCDC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable stepping for the output of VDD_SOC of DCDC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
