mkj/imxrt-pacs/svd/MIMXRT1041.svd
        <register>
          <name>HPCR</name>
          <description>SNVS_HP Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTC_EN</name>
              <description>HP Real Time Counter Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>RTC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>RTC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPTA_EN</name>
              <description>HP Time Alarm Enable When set, the time alarm interrupt is generated if the value in the HP Time Alarm Registers is equal to the value of the HP Real Time Counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HP Time Alarm Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HP Time Alarm Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS_PI</name>
              <description>Disable periodic interrupt in the functional interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Periodic interrupt will trigger a functional interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable periodic interrupt in the function interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI_EN</name>
              <description>HP Periodic Interrupt Enable The periodic interrupt can be generated only if the HP Real Time Counter is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HP Periodic Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HP Periodic Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI_FREQ</name>
              <description>Periodic Interrupt Frequency Defines frequency of the periodic interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_BIT_0</name>
                  <description>- bit 0 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_1</name>
                  <description>- bit 1 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_2</name>
                  <description>- bit 2 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_3</name>
                  <description>- bit 3 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_4</name>
                  <description>- bit 4 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_5</name>
                  <description>- bit 5 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_6</name>
                  <description>- bit 6 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_7</name>
                  <description>- bit 7 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_8</name>
                  <description>- bit 8 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_9</name>
                  <description>- bit 9 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_10</name>
                  <description>- bit 10 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_11</name>
                  <description>- bit 11 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_12</name>
                  <description>- bit 12 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_13</name>
                  <description>- bit 13 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_14</name>
                  <description>- bit 14 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_1r5</name>
                  <description>- bit 15 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPCALB_EN</name>
              <description>HP Real Time Counter Calibration Enabled Indicates that the time calibration mechanism is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HP Timer calibration disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HP Timer calibration enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPCALB_VAL</name>
              <description>HP Calibration Value Defines signed calibration value for the HP Real Time Counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD_0_PER_32768_TICKS</name>
                  <description>+0 counts per each 32768 ticks of the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_1_PER_32768_TICKS</name>
                  <description>+1 counts per each 32768 ticks of the counter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_2_PER_32768_TICKS</name>
                  <description>+2 counts per each 32768 ticks of the counter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_15_PER_32768_TICKS</name>
                  <description>+15 counts per each 32768 ticks of the counter</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_16_PER_32768_TICKS</name>
                  <description>-16 counts per each 32768 ticks of the counter</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_15_PER_32768_TICKS</name>
                  <description>-15 counts per each 32768 ticks of the counter</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_2_PER_32768_TICKS</name>
                  <description>-2 counts per each 32768 ticks of the counter</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_1_PER_32768_TICKS</name>
                  <description>-1 counts per each 32768 ticks of the counter</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_TS</name>
              <description>HP Time Synchronize</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_TIME</name>
                  <description>Synchronize the HP Time Counter to the LP Time Counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTN_CONFIG</name>
              <description>Button Configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTN_MASK</name>
              <description>Button interrupt mask</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPSICR</name>
          <description>SNVS_HP Security Interrupt Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SV0_EN</name>
              <description>Security Violation 0 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 0 security violation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 0 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 0 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV1_EN</name>
              <description>Security Violation 1 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 1 security violation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 1 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 1 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV2_EN</name>
              <description>Security Violation 2 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 2 security violation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 2 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 2 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV3_EN</name>
              <description>Security Violation 3 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 3 security violation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 3 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 3 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV4_EN</name>
              <description>Security Violation 4 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 4 security violation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 4 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 4 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV5_EN</name>
              <description>Security Violation 5 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 5 security violation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 5 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 5 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSVI_EN</name>
              <description>LP Security Violation Interrupt Enable This bit enables generating of the security interrupt to the host processor upon security violation signal from the LP section</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LP Security Violation Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LP Security Violation Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
