mkj/imxrt-pacs/svd/MIMXRT1041.svd
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_26</name>
                  <description>Divide by 26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_27</name>
                  <description>Divide by 27</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_28</name>
                  <description>Divide by 28</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_29</name>
                  <description>Divide by 29</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_30</name>
                  <description>Divide by 30</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_31</name>
                  <description>Divide by 31</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_32</name>
                  <description>Divide by 32</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_33</name>
                  <description>Divide by 33</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_34</name>
                  <description>Divide by 34</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_35</name>
                  <description>Divide by 35</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_36</name>
                  <description>Divide by 36</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_37</name>
                  <description>Divide by 37</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_38</name>
                  <description>Divide by 38</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_39</name>
                  <description>Divide by 39</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_40</name>
                  <description>Divide by 40</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_41</name>
                  <description>Divide by 41</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_42</name>
                  <description>Divide by 42</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_43</name>
                  <description>Divide by 43</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_44</name>
                  <description>Divide by 44</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_45</name>
                  <description>Divide by 45</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_46</name>
                  <description>Divide by 46</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_47</name>
                  <description>Divide by 47</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_48</name>
                  <description>Divide by 48</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_49</name>
                  <description>Divide by 49</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_50</name>
                  <description>Divide by 50</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_51</name>
                  <description>Divide by 51</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_52</name>
                  <description>Divide by 52</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_53</name>
                  <description>Divide by 53</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_54</name>
                  <description>Divide by 54</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_55</name>
                  <description>Divide by 55</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_56</name>
                  <description>Divide by 56</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_57</name>
                  <description>Divide by 57</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_58</name>
                  <description>Divide by 58</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_59</name>
                  <description>Divide by 59</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_60</name>
                  <description>Divide by 60</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_61</name>
                  <description>Divide by 61</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_62</name>
                  <description>Divide by 62</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_63</name>
                  <description>Divide by 63</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_64</name>
                  <description>Divide by 64</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_CLK_PRED</name>
              <description>Divider for sai3/adc1/adc2 clock pred.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_CLK_PRED_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO2_CLK_PODF</name>
              <description>Divider for flexio2/flexio3 clock. Divider should be updated when output clock is gated.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDE_1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_3</name>
                  <description>Divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_4</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_5</name>
                  <description>Divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_6</name>
                  <description>Divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_7</name>
                  <description>Divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_8</name>
                  <description>Divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
