mkj/imxrt-pacs/svd/MIMXRT1041.svd
        <register>
          <name>CISR</name>
          <description>CCM Interrupt Status Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>LRF_PLL</name>
              <description>CCM interrupt request 2 generated due to lock of all enabled and not bypaseed PLLs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LRF_PLL_0</name>
                  <description>interrupt is not generated due to lock ready of all enabled and not bypaseed PLLs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LRF_PLL_1</name>
                  <description>interrupt generated due to lock ready of all enabled and not bypaseed PLLs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COSC_READY</name>
              <description>CCM interrupt request 2 generated due to on board oscillator ready, i</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_READY_0</name>
                  <description>interrupt is not generated due to on board oscillator ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_READY_1</name>
                  <description>interrupt generated due to on board oscillator ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMC_PODF_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of semc_podf</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMC_PODF_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of semc_podf</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_LOADED_1</name>
                  <description>interrupt generated due to frequency change of semc_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH2_CLK_SEL_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of periph2_clk_sel</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH2_CLK_SEL_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of periph2_clk_sel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH2_CLK_SEL_LOADED_1</name>
                  <description>interrupt generated due to frequency change of periph2_clk_sel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PODF_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of ahb_podf</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_PODF_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of ahb_podf</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_LOADED_1</name>
                  <description>interrupt generated due to frequency change of ahb_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK_SEL_LOADED</name>
              <description>CCM interrupt request 1 generated due to update of periph_clk_sel.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_LOADED_0</name>
                  <description>interrupt is not generated due to update of periph_clk_sel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_LOADED_1</name>
                  <description>interrupt generated due to update of periph_clk_sel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_PODF_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of arm_podf</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of arm_podf</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_1</name>
                  <description>interrupt generated due to frequency change of arm_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIMR</name>
          <description>CCM Interrupt Mask Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK_LRF_PLL</name>
              <description>mask interrupt generation due to lrf of PLLs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_LRF_PLL_0</name>
                  <description>don't mask interrupt due to lrf of PLLs - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_LRF_PLL_1</name>
                  <description>mask interrupt due to lrf of PLLs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_COSC_READY</name>
              <description>mask interrupt generation due to on board oscillator ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_COSC_READY_0</name>
                  <description>don't mask interrupt due to on board oscillator ready - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_COSC_READY_1</name>
                  <description>mask interrupt due to on board oscillator ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_SEMC_PODF_LOADED</name>
              <description>mask interrupt generation due to frequency change of semc_podf</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_SEMC_PODF_LOADED_0</name>
                  <description>don't mask interrupt due to frequency change of semc_podf - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_SEMC_PODF_LOADED_1</name>
                  <description>mask interrupt due to frequency change of semc_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_PERIPH2_CLK_SEL_LOADED</name>
              <description>mask interrupt generation due to update of periph2_clk_sel.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_PERIPH2_CLK_SEL_LOADED_0</name>
                  <description>don't mask interrupt due to update of periph2_clk_sel - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_PERIPH2_CLK_SEL_LOADED_1</name>
                  <description>mask interrupt due to update of periph2_clk_sel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_AHB_PODF_LOADED</name>
              <description>mask interrupt generation due to frequency change of ahb_podf</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_AHB_PODF_LOADED_0</name>
                  <description>don't mask interrupt due to frequency change of ahb_podf - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_AHB_PODF_LOADED_1</name>
                  <description>mask interrupt due to frequency change of ahb_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_PERIPH_CLK_SEL_LOADED</name>
              <description>mask interrupt generation due to update of periph_clk_sel.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_PERIPH_CLK_SEL_LOADED_0</name>
                  <description>don't mask interrupt due to update of periph_clk_sel - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_PERIPH_CLK_SEL_LOADED_1</name>
                  <description>mask interrupt due to update of periph_clk_sel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_PODF_LOADED</name>
              <description>mask interrupt generation due to frequency change of arm_podf</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_0</name>
                  <description>don't mask interrupt due to frequency change of arm_podf - interrupt will be created</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_1</name>
                  <description>mask interrupt due to frequency change of arm_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
