mkj/imxrt-pacs/svd/MIMXRT1041.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IOMUXC</name>
      <description>IOMUXC</description>
      <groupName>IOMUXC</groupName>
      <prependToName>IOMUXC_</prependToName>
      <baseAddress>0x401F8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x790</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_00 SW MUX Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA00 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWMA00 of instance: flexpwm4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_SCK of instance: lpspi2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_XBAR_IN02 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO00 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO00 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_01 SW MUX Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA01 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWMB00 of instance: flexpwm4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_PCS0 of instance: lpspi2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_IN03 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO01 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO01 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_02 SW MUX Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA02 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWMA01 of instance: flexpwm4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_SDO of instance: lpspi2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_INOUT04 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO02 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO02 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_03 SW MUX Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA03 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWMB01 of instance: flexpwm4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_SDI of instance: lpspi2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_INOUT05 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO03 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO03 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_04 SW MUX Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA04 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWMA02 of instance: flexpwm4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_TX_DATA of instance: sai2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_INOUT06 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO04 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO04 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_05 SW MUX Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA05 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWMB02 of instance: flexpwm4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_TX_SYNC of instance: sai2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_INOUT07 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO05 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO05 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_06 SW MUX Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA06 of instance: semc</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWMA00 of instance: flexpwm2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_TX_BCLK of instance: sai2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: XBAR1_INOUT08 of instance: xbar1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO06 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO4_IO06 of instance: gpio4</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
