mkj/imxrt-pacs/svd/MIMXRT1041.svd
        <register>
          <name>SW_PAD_CTL_PAD_GPIO_SD_B1_11</name>
          <description>SW_PAD_CTL_PAD_GPIO_SD_B1_11 SW PAD Control Register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10B0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRE</name>
              <description>Slew Rate Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRE_0_Slow_Slew_Rate</name>
                  <description>Slow Slew Rate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRE_1_Fast_Slew_Rate</name>
                  <description>Fast Slew Rate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSE</name>
              <description>Drive Strength Field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSE_0_output_driver_disabled</name>
                  <description>output driver disabled;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_1_R0_150_Ohm_3_3V_260_Ohm_1_8V</name>
                  <description>R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_2_R0_2</name>
                  <description>R0/2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_3_R0_3</name>
                  <description>R0/3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_4_R0_4</name>
                  <description>R0/4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_5_R0_5</name>
                  <description>R0/5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_6_R0_6</name>
                  <description>R0/6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_7_R0_7</name>
                  <description>R0/7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPEED_0_low_50MHz</name>
                  <description>low(50MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPEED_1_medium_100MHz</name>
                  <description>medium(100MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPEED_2_fast_150MHz</name>
                  <description>fast(150MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPEED_3_max_200MHz</name>
                  <description>max(200MHz)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODE</name>
              <description>Open Drain Enable Field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODE_0_Open_Drain_Disabled</name>
                  <description>Open Drain Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODE_1_Open_Drain_Enabled</name>
                  <description>Open Drain Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKE</name>
              <description>Pull / Keep Enable Field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKE_0_Pull_Keeper_Disabled</name>
                  <description>Pull/Keeper Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKE_1_Pull_Keeper_Enabled</name>
                  <description>Pull/Keeper Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull / Keep Select Field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUE_0_Keeper</name>
                  <description>Keeper</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUE_1_Pull</name>
                  <description>Pull</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUS</name>
              <description>Pull Up / Down Config. Field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUS_0_100K_Ohm_Pull_Down</name>
                  <description>100K Ohm Pull Down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_1_47K_Ohm_Pull_Up</name>
                  <description>47K Ohm Pull Up</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_2_100K_Ohm_Pull_Up</name>
                  <description>100K Ohm Pull Up</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_3_22K_Ohm_Pull_Up</name>
                  <description>22K Ohm Pull Up</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYS</name>
              <description>Hyst. Enable Field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYS_0_Hysteresis_Disabled</name>
                  <description>Hysteresis Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYS_1_Hysteresis_Enabled</name>
                  <description>Hysteresis Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANATOP_USB_OTG1_ID_SELECT_INPUT</name>
          <description>ANATOP_USB_OTG1_ID_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_02_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_B1_02 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_PMIC_READY_SELECT_INPUT</name>
          <description>CCM_PMIC_READY_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_03_ALT6</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_12_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B0_12 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_01_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_B1_01 for Mode: ALT4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_32_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_32 for Mode: ALT3</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_IPG_CLK_RMII_SELECT_INPUT</name>
          <description>ENET_IPG_CLK_RMII_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_10_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_10 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_MDIO_SELECT_INPUT</name>
          <description>ENET_MDIO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_05_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B1_05 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_41_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_41 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_15_ALT0</name>
                  <description>Selecting Pad: GPIO_B1_15 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET0_RXDATA_SELECT_INPUT</name>
          <description>ENET0_RXDATA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_20_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_20 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_04_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_04 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET1_RXDATA_SELECT_INPUT</name>
          <description>ENET1_RXDATA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_19_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_19 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_05_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_05 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_RXEN_SELECT_INPUT</name>
          <description>ENET_RXEN_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_06_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_06 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_RXERR_SELECT_INPUT</name>
          <description>ENET_RXERR_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_26_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_26 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_11_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_11 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET0_TIMER_SELECT_INPUT</name>
          <description>ENET0_TIMER_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_15_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_B0_15 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_11_ALT7</name>
                  <description>Selecting Pad: GPIO_AD_B0_11 for Mode: ALT7</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_12_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_12 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_TXCLK_SELECT_INPUT</name>
          <description>ENET_TXCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_10_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_10 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXCAN1_RX_SELECT_INPUT</name>
          <description>FLEXCAN1_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_03_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_18_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_18 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_03_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_03 for Mode: ALT2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
