mkj/imxrt-pacs/svd/MIMXRT1041.svd
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FA_BIT3_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FA_BIT3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_01_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_01 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_29_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_29 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_10_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_10 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT0_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_13_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_13 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_11_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_11 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT1_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_14_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_14 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_07_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_07 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT2_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_15_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_15 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_03_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_03 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT3_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x74C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_16_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_16 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_04_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_04 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_SCK_FA_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_SCK_FA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_05_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_05 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_08_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_08 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_SCK_FB_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_SCK_FB_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x754</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_12_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_12 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_01_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_01 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT1_IPP_IND_CAPIN1_SELECT_INPUT</name>
          <description>GPT1_IPP_IND_CAPIN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x758</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_24_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_24 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_05_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_05 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT1_IPP_IND_CAPIN2_SELECT_INPUT</name>
          <description>GPT1_IPP_IND_CAPIN2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x75C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_06_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_06 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT1_IPP_IND_CLKIN_SELECT_INPUT</name>
          <description>GPT1_IPP_IND_CLKIN_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_13_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B0_13 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_04_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_04 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT2_IPP_IND_CAPIN1_SELECT_INPUT</name>
          <description>GPT2_IPP_IND_CAPIN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_41_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_41 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_03_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_B1_03 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT2_IPP_IND_CAPIN2_SELECT_INPUT</name>
          <description>GPT2_IPP_IND_CAPIN2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x768</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_40_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_40 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_04_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_B1_04 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT2_IPP_IND_CLKIN_SELECT_INPUT</name>
          <description>GPT2_IPP_IND_CLKIN_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x76C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_09_ALT7</name>
                  <description>Selecting Pad: GPIO_AD_B0_09 for Mode: ALT7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_02_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_B1_02 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPG_CLK_SAI_MCLK_SELECT_INPUT_2</name>
          <description>SAI3_IPG_CLK_SAI_MCLK_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_37_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_37 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_04_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_04 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_RXBCLK_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_RXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x774</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_35_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_35 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_06_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_06 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_RXDATA_SELECT_INPUT_0</name>
          <description>SAI3_IPP_IND_SAI_RXDATA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x778</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_33_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_33 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_00_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_00 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x77C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_34_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_34 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_05_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_05 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_38_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_38 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_03_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
