mkj/imxrt-pacs/svd/MIMXRT1041.svd
          <register>
            <name>SMFRCTRL</name>
            <description>Fractional Control Register</description>
            <addressOffset>0x20</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FRAC1_EN</name>
                <description>Fractional Cycle PWM Period Enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disable fractional cycle length for the PWM period.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enable fractional cycle length for the PWM period.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRAC23_EN</name>
                <description>Fractional Cycle Placement Enable for PWM_A</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disable fractional cycle placement for PWM_A.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enable fractional cycle placement for PWM_A.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRAC45_EN</name>
                <description>Fractional Cycle Placement Enable for PWM_B</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disable fractional cycle placement for PWM_B.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enable fractional cycle placement for PWM_B.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRAC_PU</name>
                <description>Fractional Delay Circuit Power Up</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TURN_OFF</name>
                    <description>Turn off fractional delay logic.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POWER_UP</name>
                    <description>Power up fractional delay logic.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TEST</name>
                <description>Test Status Bit</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SMOCTRL</name>
            <description>Output Control Register</description>
            <addressOffset>0x22</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PWMXFS</name>
                <description>PWM_X Fault State</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOGIC_0</name>
                    <description>Output is forced to logic 0 state prior to consideration of output polarity control.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOGIC_1</name>
                    <description>Output is forced to logic 1 state prior to consideration of output polarity control.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRISTATED_2</name>
                    <description>Output is tristated.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRISTATED_3</name>
                    <description>Output is tristated.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWMBFS</name>
                <description>PWM_B Fault State</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOGIC_0</name>
                    <description>Output is forced to logic 0 state prior to consideration of output polarity control.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOGIC_1</name>
                    <description>Output is forced to logic 1 state prior to consideration of output polarity control.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRISTATED_2</name>
                    <description>Output is tristated.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRISTATED_3</name>
                    <description>Output is tristated.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWMAFS</name>
                <description>PWM_A Fault State</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOGIC_0</name>
                    <description>Output is forced to logic 0 state prior to consideration of output polarity control.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOGIC_1</name>
                    <description>Output is forced to logic 1 state prior to consideration of output polarity control.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRISTATED_2</name>
                    <description>Output is tristated.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRISTATED_3</name>
                    <description>Output is tristated.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POLX</name>
                <description>PWM_X Output Polarity</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_INVERTED</name>
                    <description>PWM_X output not inverted. A high level on the PWM_X pin represents the &quot;on&quot; or &quot;active&quot; state.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERTED</name>
                    <description>PWM_X output inverted. A low level on the PWM_X pin represents the &quot;on&quot; or &quot;active&quot; state.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POLB</name>
                <description>PWM_B Output Polarity</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_INVERTED</name>
                    <description>PWM_B output not inverted. A high level on the PWM_B pin represents the &quot;on&quot; or &quot;active&quot; state.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERTED</name>
                    <description>PWM_B output inverted. A low level on the PWM_B pin represents the &quot;on&quot; or &quot;active&quot; state.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>POLA</name>
                <description>PWM_A Output Polarity</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_INVERTED</name>
                    <description>PWM_A output not inverted. A high level on the PWM_A pin represents the &quot;on&quot; or &quot;active&quot; state.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERTED</name>
                    <description>PWM_A output inverted. A low level on the PWM_A pin represents the &quot;on&quot; or &quot;active&quot; state.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWMX_IN</name>
                <description>PWM_X Input</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PWMB_IN</name>
                <description>PWM_B Input</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PWMA_IN</name>
                <description>PWM_A Input</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SMSTS</name>
            <description>Status Register</description>
            <addressOffset>0x24</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMPF</name>
                <description>Compare Flags</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EVENT</name>
                    <description>No compare event has occurred for a particular VALx value.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVENT</name>
                    <description>A compare event has occurred for a particular VALx value.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CFX0</name>
                <description>Capture Flag X0</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CFX1</name>
                <description>Capture Flag X1</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CFB0</name>
                <description>Capture Flag B0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CFB1</name>
                <description>Capture Flag B1</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CFA0</name>
                <description>Capture Flag A0</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CFA1</name>
                <description>Capture Flag A1</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>RF</name>
                <description>Reload Flag</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_FLAG</name>
                    <description>No new reload cycle since last STS[RF] clearing</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLAG</name>
                    <description>New reload cycle since last STS[RF] clearing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REF</name>
                <description>Reload Error Flag</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_FLAG</name>
                    <description>No reload error occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLAG</name>
                    <description>Reload signal occurred with non-coherent data and MCTRL[LDOK] = 0.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RUF</name>
                <description>Registers Updated Flag</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_FLAG</name>
                    <description>No register update has occurred since last reload.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLAG</name>
                    <description>At least one of the double buffered registers has been updated since the last reload.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
